# Lecture 3

## 1. Series

In [2]:
import pandas as pd

In [8]:
a = [1,'2',3]
a

[1, '2', 3]

In [9]:
b = pd.Series(a)
b

0    1
1    2
2    3
dtype: object

In [10]:
b.index

RangeIndex(start=0, stop=3, step=1)

In [11]:
b.values

array([1, '2', 3], dtype=object)

In [12]:
pd.Series([1,['a','b'],True])

0         1
1    [a, b]
2      True
dtype: object

In [13]:
b

0    1
1    2
2    3
dtype: object

In [14]:
b[0]

1

In [15]:
b[1]

'2'

In [17]:
b[2]

3

In [18]:
c = pd.Series([1,['a','b'],True], index=['number','list','bool'])

In [19]:
c

number         1
list      [a, b]
bool        True
dtype: object

In [20]:
c.index

Index(['number', 'list', 'bool'], dtype='object')

In [22]:
c['list']

['a', 'b']

In [23]:
c[['list','number']]

list      [a, b]
number         1
dtype: object

In [24]:
c

number         1
list      [a, b]
bool        True
dtype: object

In [25]:
c['number':'bool']

number         1
list      [a, b]
bool        True
dtype: object

In [26]:
c[0:2]

number         1
list      [a, b]
dtype: object

In [30]:
d = pd.Series([1,2,3,4])
d

0    1
1    2
2    3
3    4
dtype: int64

In [28]:
d[d>2]

2    3
3    4
dtype: int64

In [29]:
d[d>2].index

Int64Index([2, 3], dtype='int64')

In [31]:
2 * d

0    2
1    4
2    6
3    8
dtype: int64

In [32]:
# construct series with a list
e = pd.Series({'CT':350, 'NY':458,'MA':122})

In [33]:
e

CT    350
MA    122
NY    458
dtype: int64

In [34]:
e.index

Index(['CT', 'MA', 'NY'], dtype='object')

In [35]:
e.values

array([350, 122, 458], dtype=int64)

In [36]:
pd.Series({'NY':458,'MA':122, 'CT':350 })

CT    350
MA    122
NY    458
dtype: int64

In [78]:
f = pd.Series({'NY':458,'MA':122, 'CT':350 }, index=['MA','CT','NH'])
f

MA    122.0
CT    350.0
NH      NaN
dtype: float64

In [79]:
f[['CA','MA','CT','NH']]

CA      NaN
MA    122.0
CT    350.0
NH      NaN
dtype: float64

In [41]:
f.isnull()

MA    False
CT    False
NH     True
dtype: bool

In [42]:
f.isnull

<bound method NDFrame.isnull of MA    122.0
CT    350.0
NH      NaN
dtype: float64>

# 2. Data Frame

In [43]:
d1 = pd.DataFrame({'state':['CT','CT','CT','NY','NY'], 
                  'year':[2010,2011,2013,2012,2013],
                  'pop':[3,3.1,3.2,15.6,15.7]})

In [44]:
d1

    pop state  year
0   3.0    CT  2010
1   3.1    CT  2011
2   3.2    CT  2013
3  15.6    NY  2012
4  15.7    NY  2013

In [47]:
d2 = pd.DataFrame({'state':['CT','CT','CT','NY','NY'], 
                  'year':[2010,2011,2013,2012,2013],
                  'pop':[3,3.1,3.2,15.6,15.7]}, columns=['state','year','pop','debt'])

In [48]:
d2

  state  year   pop debt
0    CT  2010   3.0  NaN
1    CT  2011   3.1  NaN
2    CT  2013   3.2  NaN
3    NY  2012  15.6  NaN
4    NY  2013  15.7  NaN

In [49]:
d1

    pop state  year
0   3.0    CT  2010
1   3.1    CT  2011
2   3.2    CT  2013
3  15.6    NY  2012
4  15.7    NY  2013

In [50]:
d3 = pd.DataFrame(d1, columns=['state','year','pop','debt'])

In [51]:
d3

  state  year   pop  debt
0    CT  2010   3.0   NaN
1    CT  2011   3.1   NaN
2    CT  2013   3.2   NaN
3    NY  2012  15.6   NaN
4    NY  2013  15.7   NaN

In [52]:
d3.state

0    CT
1    CT
2    CT
3    NY
4    NY
Name: state, dtype: object

In [53]:
d3['state']

0    CT
1    CT
2    CT
3    NY
4    NY
Name: state, dtype: object

# Reindexing

In [68]:
s1 = pd.Series(range(3), index=['a','b','c'])

In [69]:
s1

a    0
b    1
c    2
dtype: int32

In [71]:
s1.reindex(['a','c','b','d'])

a    0.0
c    2.0
b    1.0
d    NaN
dtype: float64

In [76]:
s1.reindex(['a','c','b','d','e'], fill_value=-2)

a    0
c    2
b    1
d   -2
e   -2
dtype: int32

In [81]:
s1

a    0
b    1
c    2
dtype: int32

In [83]:
s1.drop('b')

a    0
c    2
dtype: int32

In [84]:
s1

a    0
b    1
c    2
dtype: int32

In [85]:
s2 = s1.drop('b')
s2

a    0
c    2
dtype: int32

In [92]:
s1 = pd.Series(range(3), index=['a','b','c'])
s1.drop(['b','a'],inplace=True)
s1

c    2
dtype: int32

In [97]:
d3 = pd.DataFrame({'state':['CT','CT','CT','NY','NY'], 
                  'year':[2010,2011,2013,2012,2013],
                  'pop':[3,3.1,3.2,15.6,15.7]}, columns=['state','year','pop','debt'])

In [98]:
d3

  state  year   pop debt
0    CT  2010   3.0  NaN
1    CT  2011   3.1  NaN
2    CT  2013   3.2  NaN
3    NY  2012  15.6  NaN
4    NY  2013  15.7  NaN

In [99]:
d3.index = ['one','two','three','four','five']
d3

      state  year   pop debt
one      CT  2010   3.0  NaN
two      CT  2011   3.1  NaN
three    CT  2013   3.2  NaN
four     NY  2012  15.6  NaN
five     NY  2013  15.7  NaN

In [100]:
# Drop rows and columns
d4 = d3.drop('five')

In [101]:
d4

      state  year   pop debt
one      CT  2010   3.0  NaN
two      CT  2011   3.1  NaN
three    CT  2013   3.2  NaN
four     NY  2012  15.6  NaN

In [104]:
d3.drop(['one','four'],inplace=True)
d3

      state  year   pop debt
two      CT  2011   3.1  NaN
three    CT  2013   3.2  NaN
five     NY  2013  15.7  NaN

In [107]:
d3.drop(['debt','state'],axis=1)

       year   pop
two    2011   3.1
three  2013   3.2
five   2013  15.7

In [112]:
d3.new = {'state':1, 'year':2, 'pop':5, 'debt':0}

In [121]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'))
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df

   A  B
0  1  2
1  3  4

In [116]:
df2

   A  B
0  5  6
1  7  8

In [117]:
# Append two data frames
df3 = df.append(df2)

In [120]:
df.loc[4] = [9, 10]

   A   B
0  1   2
1  3   4
4  9  10

In [122]:
df

   A  B
0  1  2
1  3  4

In [123]:
# Add one single row
df.loc[2] = [9, 10]

In [129]:
df[0:2]

   A  B
0  1  2
1  3  4

In [130]:
df[['A','B']]

   A   B
0  1   2
1  3   4
2  9  10

In [131]:
df['A']

0    1
1    3
2    9
Name: A, dtype: int64

In [132]:
df.A

0    1
1    3
2    9
Name: A, dtype: int64

In [133]:
d3

      state  year   pop debt
two      CT  2011   3.1  NaN
three    CT  2013   3.2  NaN
five     NY  2013  15.7  NaN

In [135]:
d3[0:2]

      state  year  pop debt
two      CT  2011  3.1  NaN
three    CT  2013  3.2  NaN

In [138]:
d3[0:2][['state','pop']]

      state  pop
two      CT  3.1
three    CT  3.2

In [141]:
# Acessing by row and column index
d3.iloc[[0,2], [0,2]]

     state   pop
two     CT   3.1
five    NY  15.7

In [143]:
# Accessing by row and column names
d3.loc[['one','three'], ['state','pop']]

      state  pop
one     NaN  NaN
three    CT  3.2

In [144]:
d3[1:1]

Empty DataFrame
Columns: [state, year, pop, debt]
Index: []

In [147]:
d3

      state  year   pop debt
two      CT  2011   3.1  NaN
three    CT  2013   3.2  NaN
five     NY  2013  15.7  NaN

In [158]:
d3.ix[d3.year>2012, :]

      state  year   pop debt
three    CT  2013   3.2  NaN
five     NY  2013  15.7  NaN

In [162]:
d3.columns = ['state','year','population','debt']

In [165]:
# Logical indexing
d3.ix[d3.population>4, ['state','year']]

     state  year
five    NY  2013

In [168]:
# Recommended over ix
d3.loc[d3.population>4, ['state','year']]

     state  year
five    NY  2013

In [179]:
# Auto alignment
x1 = pd.DataFrame([1,2,3,4,5,6], index=['a','b','c','d','e','f'])
x1

   0
a  1
b  2
c  3
d  4
e  5
f  6

In [182]:
x2 = pd.DataFrame([2,3,4,5,5,5], index=['d','e','f','a','b','c'])
x2

   0
d  2
e  3
f  4
a  5
b  5
c  5

In [183]:
x1+x2

    0
a   6
b   7
c   8
d   6
e   8
f  10

In [188]:
import numpy as np
df1 = pd.DataFrame(np.arange(9).reshape(3,3), columns=list('abc'), index=['hoio','texas','connecticut'])

In [190]:
df1

             a  b  c
hoio         0  1  2
texas        3  4  5
connecticut  6  7  8

In [192]:
df2 = df1.loc[['texas','connecticut','hoio'], ['b','c','a']]
df2

             b  c  a
texas        4  5  3
connecticut  7  8  6
hoio         1  2  0

In [193]:
df1 + df2

              a   b   c
connecticut  12  14  16
hoio          0   2   4
texas         6   8  10

In [196]:
df2.loc[3] = [4,1,0]
df2

             b  c  a
texas        4  5  3
connecticut  7  8  6
hoio         1  2  0
3            4  1  0

In [197]:
df1 + df2

C:\Users\jpeng3\AppData\Local\Continuum\Anaconda3\lib\site-packages\pandas\core\generic.py:4809: RuntimeWarning: '<' not supported between instances of 'str' and 'int', sort order is undefined for incomparable objects
  other.index, how=join, level=level, return_indexers=True)

                a     b     c
hoio          0.0   2.0   4.0
texas         6.0   8.0  10.0
connecticut  12.0  14.0  16.0
3             NaN   NaN   NaN

In [199]:
# Broadcasting
df1

             a  b  c
hoio         0  1  2
texas        3  4  5
connecticut  6  7  8

In [208]:
v = df1.iloc[0]
v

a    0
b    1
c    2
Name: hoio, dtype: int32

In [209]:
df1 - v

             a  b  c
hoio         0  0  0
texas        3  3  3
connecticut  6  6  6

In [210]:
v2 = df1['a']
v2

hoio           0
texas          3
connecticut    6
Name: a, dtype: int32

In [212]:
df1-v2

              a   b   c  connecticut  hoio  texas
hoio        NaN NaN NaN          NaN   NaN    NaN
texas       NaN NaN NaN          NaN   NaN    NaN
connecticut NaN NaN NaN          NaN   NaN    NaN

In [213]:
# broadcast along the horizon direction
df1.sub(v2, axis=0)

             a  b  c
hoio         0  1  2
texas        0  1  2
connecticut  0  1  2

In [205]:
v

hoio           0
texas          3
connecticut    6
Name: a, dtype: int32

In [215]:
# Missing values
df1

             a  b  c
hoio         0  1  2
texas        3  4  5
connecticut  6  7  8

In [218]:
df1.iloc[0,0] = None
df1

               a  b  c
hoio         NaN  1  2
texas        3.0  4  5
connecticut  6.0  7  8

In [219]:
from numpy import nan as NA

In [221]:
df1.iloc[1,1] = NA
df1

               a    b  c
hoio         NaN  1.0  2
texas        3.0  NaN  5
connecticut  6.0  7.0  8

In [222]:
df1.isnull()

                 a      b      c
hoio          True  False  False
texas        False   True  False
connecticut  False  False  False

In [224]:
df1.dropna()

               a    b  c
connecticut  6.0  7.0  8

In [225]:
df1.fillna(-2)

               a    b  c
hoio        -2.0  1.0  2
texas        3.0 -2.0  5
connecticut  6.0  7.0  8

In [227]:
df1[df1>5] = 0
df1

               a    b  c
hoio         NaN  1.0  2
texas        3.0  NaN  5
connecticut  0.0  0.0  0

In [229]:
df1[df1.isnull()] = -2
df1

               a    b  c
hoio        -2.0  1.0  2
texas        3.0 -2.0  5
connecticut  0.0  0.0  0

In [230]:
df1

               a    b  c
hoio        -2.0  1.0  2
texas        3.0 -2.0  5
connecticut  0.0  0.0  0

In [231]:
df1[df1<0] = NA
df1

               a    b  c
hoio         NaN  1.0  2
texas        3.0  NaN  5
connecticut  0.0  0.0  0

In [234]:
df1.fillna(-2, inplace=True)

In [235]:
df1

               a    b  c
hoio        -2.0  1.0  2
texas        3.0 -2.0  5
connecticut  0.0  0.0  0

In [236]:
# Descriptive stats
df1

               a    b  c
hoio        -2.0  1.0  2
texas        3.0 -2.0  5
connecticut  0.0  0.0  0

In [237]:
df1.count()

a    3
b    3
c    3
dtype: int64

In [239]:
df1.count(axis=1)

hoio           3
texas          3
connecticut    3
dtype: int64

In [240]:
df1.sum()

a    1.0
b   -1.0
c    7.0
dtype: float64

In [241]:
df1.sum(axis=1)

hoio           1.0
texas          6.0
connecticut    0.0
dtype: float64

In [242]:
df1.max()

a    3.0
b    1.0
c    5.0
dtype: float64

In [244]:
df1.mean()

a    0.333333
b   -0.333333
c    2.333333
dtype: float64

In [245]:
df1.std()

a    2.516611
b    1.527525
c    2.516611
dtype: float64

In [251]:
df1.quantile(q=[0,1])

       a    b    c
0.0 -2.0 -2.0  0.0
1.0  3.0  1.0  5.0

In [249]:
df1

               a    b  c
hoio        -2.0  1.0  2
texas        3.0 -2.0  5
connecticut  0.0  0.0  0

In [252]:
# Apply functions
df2 = pd.DataFrame(np.random.randn(4,3), columns=list('abc'),index=['TX','CT','MA','NY'])

In [253]:
df2

           a         b         c
TX -0.305984 -0.666343 -0.199118
CT  0.200041 -0.467896  1.672671
MA -1.479674 -0.168670 -0.493888
NY -0.321758 -0.073203  0.472260

In [254]:
# lambda function
fun1 = lambda x: '%.2f' % x

In [255]:
fun1(0.1234455)

'0.12'

In [259]:
def fun2(x): return '%.2f' % x

In [260]:
fun2(0.1234455)

'0.12'

In [262]:
# apply it elementwise: applymap
df2.applymap(fun1)

        a      b      c
TX  -0.31  -0.67  -0.20
CT   0.20  -0.47   1.67
MA  -1.48  -0.17  -0.49
NY  -0.32  -0.07   0.47

In [263]:
df2.applymap(fun2)

        a      b      c
TX  -0.31  -0.67  -0.20
CT   0.20  -0.47   1.67
MA  -1.48  -0.17  -0.49
NY  -0.32  -0.07   0.47

In [264]:
# apply row or column wise
fun3 = lambda x : x.max() - x.min()

In [265]:
fun3(df2['a'])

1.6797150950705737

In [266]:
df2.apply(fun3)

a    1.679715
b    0.593140
c    2.166559
dtype: float64

In [267]:
# 
df2.apply(fun3, axis=0)

a    1.679715
b    0.593140
c    2.166559
dtype: float64

In [268]:
df2.apply(fun3, axis=1)

TX    0.467225
CT    2.140567
MA    1.311004
NY    0.794018
dtype: float64

In [270]:
df2.apply(lambda x : x.max() - x.min())

a    1.679715
b    0.593140
c    2.166559
dtype: float64

In [273]:
# using established functions
df2.applymap(np.sqrt)

C:\Users\jpeng3\AppData\Local\Continuum\Anaconda3\lib\site-packages\pandas\core\frame.py:4549: RuntimeWarning: invalid value encountered in sqrt
  return lib.map_infer(x.asobject, func)

          a   b         c
TX      NaN NaN       NaN
CT  0.44726 NaN  1.293318
MA      NaN NaN       NaN
NY      NaN NaN  0.687212

In [274]:
# Read and save files
df2

           a         b         c
TX -0.305984 -0.666343 -0.199118
CT  0.200041 -0.467896  1.672671
MA -1.479674 -0.168670 -0.493888
NY -0.321758 -0.073203  0.472260

In [275]:
import os

In [276]:
os.getcwd()

'C:\\Users\\jpeng3'

In [280]:
os.chdir('D:/Dropbox/Teaching/Data Science using Python/OPIM5894/Lecture3')

In [281]:
os.getcwd()

'D:\\Dropbox\\Teaching\\Data Science using Python\\OPIM5894\\Lecture3'

In [282]:
df2.to_csv('df2.csv')

In [283]:
df2.to_excel('df2.xlsx')

In [285]:
df.loaded = pd.read_csv('df2.csv')

In [286]:
df.loaded

  Unnamed: 0         a         b         c
0         TX -0.305984 -0.666343 -0.199118
1         CT  0.200041 -0.467896  1.672671
2         MA -1.479674 -0.168670 -0.493888
3         NY -0.321758 -0.073203  0.472260

In [287]:
df.loaded2 = pd.read_excel('df2.xlsx')

In [288]:
df.loaded2

           a         b         c
TX -0.305984 -0.666343 -0.199118
CT  0.200041 -0.467896  1.672671
MA -1.479674 -0.168670 -0.493888
NY -0.321758 -0.073203  0.472260